alexandruradovici/ATmega32-Arduino/mega32/boards.txt
mega32-1.name=ATmega32-1mhz
mega32-1.build.mcu=atmega32
mega32-1.build.f_cpu=1000000L
mega32-1.upload.maximum_size=32000
mega32-1.bootloader.low_fuses=0xE1
mega32-1.bootloader.high_fuses=0xD9
mega32-1.bootloader.extended_fuses=0xFD
mega32-1.build.core=arduino:arduino
mega32-1.build.variant=mega32

mega32-8.name=ATmega32-8mhz
mega32-8.build.mcu=atmega32
mega32-8.build.f_cpu=8000000L
mega32-8.upload.maximum_size=32000
mega32-8.bootloader.low_fuses=0xE4
mega32-8.bootloader.high_fuses=0xD9
mega32-8.bootloader.extended_fuses=0xFD
mega32-8.build.core=arduino:arduino
mega32-8.build.variant=mega32